configuration/src/DataProcessors/СозданныеМной/СозданныеМной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданныеМной</name>
</mdclass:DataProcessor>

configuration/src/InformationRegisters/СтатусыЗаявокПоСистемам/СтатусыЗаявокПоСистемам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокПоСистемам</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/МинимальныеСтатусыЗаявок/МинимальныеСтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МинимальныеСтатусыЗаявок</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СтруктураПодчиненности/СтруктураПодчиненности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтруктураПодчиненности</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектСтруктурыПодчиненности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>DefinedType.ОбъектСтруктурыПодчиненности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ЛичныеДела/ЛичныеДела.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛичныеДела</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Филиалы</types>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоЛичнымДелам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/СобытияПоЛичнымДелам/СобытияПоЛичнымДелам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияПоЛичнымДелам</name>
  <enumValues>
    <name>МестоРаботыРегл</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВДругоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКастомнуюКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПринятНаДолжность</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ТипыФилиалов/ТипыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФилиалов</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>НеIT</name>
  </enumValues>
  <enumValues>
    <name>QA</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/ЗаявкаНаРазработку/ЗаявкаНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРазработку</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Некоторые заявки находятся в статусе &quot;Черновик&quot;. При отключении этого статуса дата документа меняется на текущую. Чтобы не потерять исходную дату создания заявки, она помещается в этот реквизит</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСистемРазработки</name>
    <comment>Количество систем разработки для заявки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСистем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинальныйСтатус</name>
    <comment>Финальный статус заявки</comment>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СистемыРазработки</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаЗаказчиков</name>
      <type>
        <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.ЗаявкаНаРазработку</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомандаРазработчиков</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаStoryPoint</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПубликация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/DataProcessors/СозданныеМной/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ПолучитьДанныеСписок_Заявки(НастройкиСписка, АдресРезультата, УИДЗамера) Экспорт

	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();

	ДанныеДерева = СформироватьСписокЗаявки(НастройкиСписка);
	ИнструментыСервер.ОповеститьИнструментОбОбновлении(ДанныеДерева, АдресРезультата, УИДЗамера);

	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический(
		"Обработки.СозданныеМной.ПолучитьДанныеСписок_Заявки.ВыполнениеФонового", ВремяНачала, , Строка(УИДЗамера));

КонецПроцедуры

Процедура ПолучитьДанныеСписок_Задачи(НастройкиСписка, АдресРезультата, УИДЗамера) Экспорт

	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();

	ДанныеДерева = СформироватьСписокЗадачи(НастройкиСписка);
	ИнструментыСервер.ОповеститьИнструментОбОбновлении(ДанныеДерева, АдресРезультата, УИДЗамера);

	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический(
		"Обработки.СозданныеМной.ПолучитьДанныеСписок_Задачи.ВыполнениеФонового", ВремяНачала, , Строка(УИДЗамера));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСписокЗаявки(Знач НастройкиСписка)

	КолонкиИнструмента = Новый Массив;
	КолонкиИнструмента.Добавить("Наименование");
	КолонкиИнструмента.Добавить("Назначена");
	КолонкиИнструмента.Добавить("СтатусПредставление");
	КолонкиИнструмента.Добавить("ИзменениеСтатуса");
	КолонкиИнструмента.Добавить("СистемаПредставление");
	КолонкиИнструмента.Добавить("Автор");
	КолонкиИнструмента.Добавить("ИндексКартинки");
	КолонкиИнструмента.Добавить("Заявка");
	КолонкиИнструмента.Добавить("UID");
	КолонкиИнструмента.Добавить("ДатаСоздания");

	Таблица = Новый ТаблицаЗначений;
	Для Каждого Колонка Из КолонкиИнструмента Цикл
		Таблица.Колонки.Добавить(Колонка);
	КонецЦикла;
	
	ДатаНачала = НастройкиСписка.Период.ДатаНачала;
	ДатаОкончания = НастройкиСписка.Период.ДатаОкончания;
	ВыбранныеСтатусы = НастройкиСписка.ВыбранныеСтатусы;
	ВыбранныеСистемы = НастройкиСписка.ВыбранныеСистемы;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ДокументЗаявка.Ссылка КАК Ссылка,
	|	ДокументЗаявка.Номер КАК Номер,
	|	ДокументЗаявка.Дата КАК Дата,
	|	ДокументЗаявка.Наименование КАК Наименование,
	|	ЗаявкаНаРазработкуСистемыРазработки.Система КАК Система
	|ПОМЕСТИТЬ ЗаявкиНаРазработку
	|ИЗ
	|	Документ.ЗаявкаНаРазработку КАК ДокументЗаявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку.СистемыРазработки КАК ЗаявкаНаРазработкуСистемыРазработки
	|		ПО ДокументЗаявка.Ссылка = ЗаявкаНаРазработкуСистемыРазработки.Ссылка
	|ГДЕ
	|	ДокументЗаявка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДокументЗаявка.Автор = &Автор
	|	И ЗаявкаНаРазработкуСистемыРазработки.Система В(&ВыбранныеСистемы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаРазработку.Ссылка КАК Заявка,
	|	ЗаявкиНаРазработку.Система КАК Система,
	|	СтатусыЗаявокПоСистемам.Статус КАК Статус,
	|	СтатусыОбъектов.Порядок КАК ПорядокСтатуса
	|ПОМЕСТИТЬ СтатусыПоСистемам
	|ИЗ
	|	ЗаявкиНаРазработку КАК ЗаявкиНаРазработку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявокПоСистемам КАК СтатусыЗаявокПоСистемам
	|		ПО ЗаявкиНаРазработку.Ссылка = СтатусыЗаявокПоСистемам.Заявка
	|			И ЗаявкиНаРазработку.Система = СтатусыЗаявокПоСистемам.Система
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО (СтатусыЗаявокПоСистемам.Статус = СтатусыОбъектов.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыПоСистемам.Заявка КАК Заявка,
	|	МИНИМУМ(СтатусыПоСистемам.ПорядокСтатуса) КАК ПорядокСтатуса
	|ПОМЕСТИТЬ МинимальныйСтатусЗаявокПоСистемам
	|ИЗ
	|	СтатусыПоСистемам КАК СтатусыПоСистемам
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыПоСистемам.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК ПриоритетСтроки,
	|	МинимальныйСтатусЗаявокПоСистемам.Заявка КАК Заявка,
	|	МинимальныйСтатусЗаявокПоСистемам.ПорядокСтатуса КАК ПорядокСтатуса,
	|	СтатусыПоСистемам.Статус КАК Статус
	|ПОМЕСТИТЬ СтатусыЗаявокПоПриоритетам
	|ИЗ
	|	МинимальныйСтатусЗаявокПоСистемам КАК МинимальныйСтатусЗаявокПоСистемам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатусыПоСистемам КАК СтатусыПоСистемам
	|		ПО МинимальныйСтатусЗаявокПоСистемам.Заявка = СтатусыПоСистемам.Заявка
	|			И МинимальныйСтатусЗаявокПоСистемам.ПорядокСтатуса = СтатусыПоСистемам.ПорядокСтатуса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	МинимальныеСтатусыЗаявок.Заявка,
	|	МинимальныеСтатусыЗаявок.Статус.Порядок,
	|	МинимальныеСтатусыЗаявок.Статус
	|ИЗ
	|	РегистрСведений.МинимальныеСтатусыЗаявок КАК МинимальныеСтатусыЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиНаРазработку КАК ЗаявкиНаРазработку
	|		ПО МинимальныеСтатусыЗаявок.Заявка = ЗаявкиНаРазработку.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(СтатусыЗаявокПоПриоритетам.ПриоритетСтроки) КАК ПриоритетСтроки,
	|	СтатусыЗаявокПоПриоритетам.Заявка КАК Заявка
	|ПОМЕСТИТЬ СтатусыЗаявокМинимальныйПриоритет
	|ИЗ
	|	СтатусыЗаявокПоПриоритетам КАК СтатусыЗаявокПоПриоритетам
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыЗаявокПоПриоритетам.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыЗаявокПоПриоритетам.Заявка КАК Заявка,
	|	СтатусыОбъектов.Ссылка КАК Статус,
	|	СтатусыОбъектов.ИндексКартинки КАК ИндексКартинки,
	|	ЕСТЬNULL(МинимальныеСтатусыЗаявок.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения
	|ПОМЕСТИТЬ ДополнительныеДанныеЗаявок
	|ИЗ
	|	СтатусыЗаявокПоПриоритетам КАК СтатусыЗаявокПоПриоритетам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатусыЗаявокМинимальныйПриоритет КАК СтатусыЗаявокМинимальныйПриоритет
	|		ПО СтатусыЗаявокПоПриоритетам.Заявка = СтатусыЗаявокМинимальныйПриоритет.Заявка
	|			И СтатусыЗаявокПоПриоритетам.ПриоритетСтроки = СтатусыЗаявокМинимальныйПриоритет.ПриоритетСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО СтатусыЗаявокПоПриоритетам.ПорядокСтатуса = СтатусыОбъектов.Порядок
	|			И СтатусыЗаявокПоПриоритетам.Статус = СтатусыОбъектов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныеСтатусыЗаявок КАК МинимальныеСтатусыЗаявок
	|		ПО СтатусыЗаявокПоПриоритетам.Заявка = МинимальныеСтатусыЗаявок.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаРазработку.Ссылка КАК Ссылка,
	|	ЗаявкиНаРазработку.Система КАК Система,
	|	ЕСТЬNULL(СтруктураПодчиненности.Объект, ЗНАЧЕНИЕ(Документ.Задача.ПустаяСсылка)) КАК Задача
	|ПОМЕСТИТЬ ЗаявкиПодчиненныеЗадачи
	|ИЗ
	|	ЗаявкиНаРазработку КАК ЗаявкиНаРазработку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураПодчиненности КАК СтруктураПодчиненности
	|		ПО (ЗаявкиНаРазработку.Ссылка = (ВЫРАЗИТЬ(СтруктураПодчиненности.Родитель КАК Документ.ЗаявкаНаРазработку)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛичныеДелаСрезПоследних.Сотрудник КАК Пользователь,
	|	ВЫРАЗИТЬ(ЛичныеДелаСрезПоследних.Данные КАК Справочник.Филиалы) КАК Филиал
	|ПОМЕСТИТЬ ЛичныеДелаФилиалы
	|ИЗ
	|	РегистрСведений.ЛичныеДела.СрезПоследних(&ТекущаяДата, Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоЛичнымДелам.ПереведенВДругоеПодразделение)) КАК ЛичныеДелаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиПодчиненныеЗадачи.Ссылка КАК Ссылка,
	|	ЗаявкиПодчиненныеЗадачи.Система КАК СистемаУчета,
	|	ЗаявкиПодчиненныеЗадачи.Задача КАК Задача,
	|	ВЫБОР
	|		КОГДА ЗаявкиПодчиненныеЗадачи.Задача.Назначена = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЗаявкиПодчиненныеЗадачи.Задача.Назначена = &Автор
	|			ТОГДА ""На мне""
	|		КОГДА ЗаявкиПодчиненныеЗадачи.Задача.Назначена = ЗаявкиПодчиненныеЗадачи.Задача.Заказчик
	|			ТОГДА ""Заказчик""
	|		КОГДА НЕ Филиалы.ТипФилиала ЕСТЬ NULL
	|				И Филиалы.ТипФилиала <> ЗНАЧЕНИЕ(Перечисление.ТипыФилиалов.НеIT)
	|			ТОГДА ""IT""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Назначена
	|ПОМЕСТИТЬ ЗаявкиИЗадачи
	|ИЗ
	|	ЗаявкиПодчиненныеЗадачи КАК ЗаявкиПодчиненныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Задача КАК ДокументЗадача
	|		ПО ЗаявкиПодчиненныеЗадачи.Задача = ДокументЗадача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛичныеДелаФилиалы КАК ЛичныеДелаФилиалы
	|		ПО ЗаявкиПодчиненныеЗадачи.Задача.Назначена = ЛичныеДелаФилиалы.Пользователь
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Филиалы
	|		ПО (ЛичныеДелаФилиалы.Филиал = Филиалы.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаРазработку.Ссылка КАК Заявка,
	|	ЗаявкиНаРазработку.Номер КАК Номер,
	|	ЗаявкиНаРазработку.Дата КАК ДатаСоздания,
	|	ЗаявкиНаРазработку.Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиИЗадачи.СистемаУчета) КАК СистемаПредставление,
	|	ЗаявкиИЗадачи.Назначена КАК Назначена,
	|	ПРЕДСТАВЛЕНИЕ(ДополнительныеДанныеЗаявок.Статус) КАК СтатусПредставление,
	|	ДополнительныеДанныеЗаявок.ИндексКартинки КАК ИндексКартинки,
	|	ДополнительныеДанныеЗаявок.ДатаИзменения КАК ИзменениеСтатуса
	|ИЗ
	|	ЗаявкиИЗадачи КАК ЗаявкиИЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДополнительныеДанныеЗаявок КАК ДополнительныеДанныеЗаявок
	|		ПО ЗаявкиИЗадачи.Ссылка = ДополнительныеДанныеЗаявок.Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиНаРазработку КАК ЗаявкиНаРазработку
	|		ПО ЗаявкиИЗадачи.Ссылка = ЗаявкиНаРазработку.Ссылка
	|			И ЗаявкиИЗадачи.СистемаУчета = ЗаявкиНаРазработку.Система
	|ГДЕ
	|	ДополнительныеДанныеЗаявок.Статус В(&ВыбранныеСтатусы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания
	|ИТОГИ ПО
	|	Заявка";
	#КонецОбласти

	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Автор", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("РазрабатываемыеСистемы", ПараметрыСеанса.РазрабатываемыеСистемы);
	Запрос.УстановитьПараметр("ВыбранныеСистемы", ВыбранныеСистемы);
	Запрос.УстановитьПараметр("ВыбранныеСтатусы", ВыбранныеСтатусы);

	ВыборкаЗаявка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаявка.Следующий() Цикл
		
		Выборка = ВыборкаЗаявка.Выбрать();
		Назначена = "";
		Системы = "";
		СозданаСтрока = Ложь;
		Пока Выборка.Следующий() Цикл
			Наименование = СтрШаблон("[%1] %2", Выборка.Номер, Выборка.Наименование);
			Если ЗначениеЗаполнено(Выборка.Назначена) Тогда
				Если СтрНайти(Назначена, Выборка.Назначена) = 0 Тогда
					Назначена = Назначена + ?(ЗначениеЗаполнено(Назначена), СтрШаблон(" / %1", Выборка.Назначена), Выборка.Назначена);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СистемаПредставление) Тогда
				Если СтрНайти(Системы, Выборка.СистемаПредставление) = 0 Тогда
					Системы = Системы + ?(ЗначениеЗаполнено(Системы), 
						СтрШаблон(", %1", Выборка.СистемаПредставление), Выборка.СистемаПредставление);
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ СозданаСтрока Тогда
				СтрокаТаблицы = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				СозданаСтрока = Истина;
			КонецЕсли;
		КонецЦикла;	
		
		UID = ОбщегоНазначенияВызовСервера.ХэшСумма(Строка(ВыборкаЗаявка.Заявка), Истина);
		СтрокаТаблицы.UID = UID;
		СтрокаТаблицы.Наименование = Наименование;
		СтрокаТаблицы.Назначена = Назначена;
		СтрокаТаблицы.СистемаПредставление = Системы;
	КонецЦикла;

	ДанныеДерева = ИнструментыСервер.ПодготовитьДанныеИнструментаДляКлиента(Таблица, КолонкиИнструмента);

	Возврат ДанныеДерева;

КонецФункции
Функция СформироватьСписокЗадачи(Знач НастройкиСписка)

	КолонкиИнструмента = Новый Массив;
	КолонкиИнструмента.Добавить("Наименование");
	КолонкиИнструмента.Добавить("СтатусПредставление");
	КолонкиИнструмента.Добавить("Назначена");
	КолонкиИнструмента.Добавить("ИзменениеСтатуса");
	КолонкиИнструмента.Добавить("СистемаПредставление");
	КолонкиИнструмента.Добавить("Автор");
	КолонкиИнструмента.Добавить("ИндексКартинки");
	КолонкиИнструмента.Добавить("Задача");
	КолонкиИнструмента.Добавить("UID");
	КолонкиИнструмента.Добавить("ДатаСоздания");

	Таблица = Новый ТаблицаЗначений;
	Для Каждого Колонка Из КолонкиИнструмента Цикл
		Таблица.Колонки.Добавить(Колонка);
	КонецЦикла;

	ДатаНачала = НастройкиСписка.Период.ДатаНачала;
	ДатаОкончания = НастройкиСписка.Период.ДатаОкончания;
	ВыбранныеСтатусы = НастройкиСписка.ВыбранныеСтатусы;
	ВыбранныеСистемы = НастройкиСписка.ВыбранныеСистемы;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задача.Ссылка КАК Задача,
	|	Задача.Номер КАК Номер,
	|	Задача.Дата КАК ДатаСоздания,
	|	Задача.Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(Задача.Назначена) КАК Назначена,
	|	ПРЕДСТАВЛЕНИЕ(Задача.Статус) КАК СтатусПредставление,
	|	Задача.ДатаИзмененияСтатуса КАК ИзменениеСтатуса,
	|	ПРЕДСТАВЛЕНИЕ(Задача.СистемаУчета) КАК СистемаПредставление,
	|	СтатусыОбъектов.ИндексКартинки КАК ИндексКартинки
	|ИЗ
	|	Документ.Задача КАК Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО Задача.Статус = СтатусыОбъектов.Ссылка
	|ГДЕ
	|	Задача.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Задача.Автор = &Автор
	|	И Задача.СистемаУчета В(&ВыбранныеСистемы)
	|	И Задача.Статус В(&ВыбранныеСтатусы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Задача.Дата";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Автор", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ВыбранныеСистемы", ВыбранныеСистемы);
	Запрос.УстановитьПараметр("ВыбранныеСтатусы", ВыбранныеСтатусы);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		Наименование = СтрШаблон("[%1] %2", Выборка.Номер, Выборка.Наименование);
		UID = ОбщегоНазначенияВызовСервера.ХэшСумма(Строка(Выборка.Задача), Истина);
		СтрокаТаблицы.UID = UID;
		СтрокаТаблицы.Наименование = Наименование;
		СтрокаТаблицы.Назначена = ОбщегоНазначенияКлиентСервер.ПолучитьФамилиюИнициалыПользователя(СтрокаТаблицы.Назначена);
	КонецЦикла;

	ДанныеДерева = ИнструментыСервер.ПодготовитьДанныеИнструментаДляКлиента(Таблица, КолонкиИнструмента);

	Возврат ДанныеДерева;

КонецФункции

#КонецОбласти
